# STLImportOptions Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
STLImportOptions Class
Members See Also
---
The import options used to import STL format files.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022.1
# Syntax
C#
---
```text
public class STLImportOptions : BaseImportOptions
```

Visual Basic
---
```text
Public Class STLImportOptions _
	Inherits BaseImportOptions
```

Visual C++
---
```text
public ref class STLImportOptions : public BaseImportOptions
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BaseImportOptions Autodesk.Revit.DB..::..STLImportOptions
# See Also
STLImportOptions Members
Autodesk.Revit.DB Namespace